{
    "answers": [
        "Continuous Delivery (CD) is a software engineering practice where code changes are automatically prepared for a release to production. It is the next step after Continuous Integration (CI), ensuring that the code is always in a deployable state. The key difference is that CI focuses on integrating code into a shared repository, while CD ensures that the code can be automatically released to production after testing.",
        "Quick-sort is a popular comparison-based sorting algorithm that uses a divide-and-conquer strategy to sort an array of elements. It selects a pivot element from the array, partitions the array into smaller subarrays based on the pivot, and recursively sorts the subarrays. Quick-sort has an average-case time complexity of O(n log n), making it efficient for large datasets. However, its worst-case time complexity is O(n^2) in the case of an already sorted or nearly sorted array.",
        "RESTful API (Representational State Transfer) is an architectural style for designing networked applications. It uses HTTP requests to perform CRUD operations (Create, Read, Update, Delete) on resources, which are represented by URLs. RESTful APIs are stateless and allow for scalable, flexible, and easy-to-use interfaces for web applications.",
        "List comprehension is a concise way to create lists in Python using a single line of code. It allows for the application of expressions to iterate over iterables. List comprehension improves efficiency by simplifying the code and reducing the need for additional loops, making the code more readable and faster.",
        "The MEAN stack is a set of technologies used to develop web applications: 1) MongoDB - a NoSQL database, 2) Express.js - a back-end web framework for Node.js, 3) Angular - a front-end web framework for building dynamic user interfaces, and 4) Node.js - a JavaScript runtime used for building server-side applications. The MEAN stack allows for end-to-end JavaScript development."
    ]
}