{
    "answers": [
        "Sorting algorithms for arrays are techniques used to rearrange the elements of an array in a particular order. Common sorting algorithms include bubble sort, selection sort, insertion sort, merge sort, and quick sort. Bubble sort compares adjacent elements in the array and swaps them if they are in the wrong order, repeatedly iterating through the array until it is sorted. Selection sort involves selecting the smallest or largest element in the unsorted portion of the array and moving it to its correct position. Insertion sort works by repeatedly inserting the next unsorted element into its correct position among the already sorted elements. Merge sort and quick sort are more efficient algorithms that use divide-and-conquer techniques to sort the array.",
        "JavaScript is a widely used programming language for building dynamic websites and web applications. JavaScript data types include primitive types such as numbers, strings, booleans, null, and undefined, as well as complex types such as objects and arrays. JavaScript frameworks are pre-written libraries or collections of reusable code that provide a structure and set of tools for developing web applications, such as Angular, React, and Vue.",
        "Front-end development involves building the user interface and user experience (UI/UX) of a website, using technologies like HTML, CSS, and JavaScript. Back-end development focuses on the server-side logic, databases, and APIs, using languages like Python, Java, or PHP. Full-stack developers are proficient in both front-end and back-end development.",
        "The Java Collections framework provides classes and interfaces for managing groups of objects. The main types of collections include Lists (which allow duplicates and ordered elements), Sets (which do not allow duplicates), and Maps (which store key-value pairs). Java Collections include classes like ArrayList, HashSet, and HashMap, which provide different ways to store and manipulate data.",
        "Scheduling Algorithms are algorithms used by an operating system to determine the order in which processes or threads are executed on a CPU. Scheduling algorithms play a critical role in managing system resources, maximizing CPU utilization, minimizing response time, and ensuring fairness among processes or threads. There are various types of scheduling algorithms, such as First-Come, First-Served (FCFS), Shortest Job Next (SJN), Round Robin (RR), and Priority-based, each with its own advantages, disadvantages, and suitability for different types of systems and workloads."
    ]
}