{
    "answers": [
        "The Java Collections framework provides classes and interfaces for managing groups of objects. The main types of collections include Lists (which allow duplicates and ordered elements), Sets (which do not allow duplicates), and Maps (which store key-value pairs). Java Collections include classes like ArrayList, HashSet, and HashMap, which provide different ways to store and manipulate data.",
        "Kernels are the central components of an operating system that manage and facilitate communication between hardware and software components. They provide essential services such as process management, memory management, device drivers, and system calls. Kernels can be classified into different types, such as monolithic kernels, microkernels, and hybrid kernels, based on their architecture and design philosophy.",
        "Django is a high-level Python web framework that encourages rapid development and clean, pragmatic design. It comes with built-in features like authentication, ORM, routing, and an admin panel. Django follows the 'batteries-included' philosophy, providing everything needed to build web applications efficiently and securely.",
        "A binary search tree (BST) is a tree-based data structure in which each node has at most two children and all the nodes in the left subtree of a node have a value less than the node's value, and all the nodes in the right subtree have a value greater than the node's value. This structure allows for fast searching, insertion, and deletion of elements. Binary search trees are often used to store data that needs to be retrieved quickly, such as in the implementation of a dictionary or set data type. They are also used in many other applications, such as for storing and organizing data in databases and for optimizing search algorithms.",
        "A Python generator is a function that allows you to iterate over a sequence of data without storing the entire sequence in memory at once. Generators yield values one at a time, making them more memory-efficient than lists when working with large datasets. They are commonly used in situations where lazy evaluation and high performance are needed."
    ]
}