{
    "answers": [
        "Virtual reality (VR) is a simulated experience that can be similar to or completely different from the real world, typically created using computer technology. Types of VR systems include desktop-based VR, mobile-based VR, and headset-based VR. Applications of VR include gaming, education and training, healthcare, architecture and design, and entertainment.",
        "JavaScript is a widely used programming language for building dynamic websites and web applications. JavaScript data types include primitive types such as numbers, strings, booleans, null, and undefined, as well as complex types such as objects and arrays. JavaScript frameworks are pre-written libraries or collections of reusable code that provide a structure and set of tools for developing web applications, such as Angular, React, and Vue.",
        "Python decorators are functions that modify the behavior of another function or class method. They allow you to wrap additional functionality around existing code without changing its core structure. Decorators are useful for tasks like logging, access control, caching, and measuring performance.",
        "The Model-View-Controller (MVC) pattern is a design pattern that separates an application into three interconnected components: 1) Model - represents the data, 2) View - handles the user interface, and 3) Controller - manages the input and updates the model and view accordingly. MVC is useful because it promotes separation of concerns, making code easier to manage and maintain.",
        "JavaScript is a widely used programming language for building dynamic websites and web applications. JavaScript data types include primitive types such as numbers, strings, booleans, null, and undefined, as well as complex types such as objects and arrays. JavaScript frameworks are pre-written libraries or collections of reusable code that provide a structure and set of tools for developing web applications, such as Angular, React, and Vue."
    ]
}