{
    "answers": [
        "Threads are lightweight, independent sequences of instructions within a process that can be executed concurrently by a single CPU. Threads share the same memory space and file descriptors with their parent process, allowing for efficient communication and coordination. Threads can be used to achieve parallelism and improve performance in multi-core processors. There are various types of threads, such as user-level threads and kernel-level threads, with different levels of thread management and support from the operating system.",
        "The Java Stream API, introduced in Java 8, provides a powerful way to process sequences of elements (e.g., from collections) using a functional approach. Streams allow you to perform operations such as filtering, mapping, and reducing data in a concise and readable manner. They are important because they enable more expressive and parallelizable code for handling collections of data.",
        "JavaScript is a widely used programming language for building dynamic websites and web applications. JavaScript data types include primitive types such as numbers, strings, booleans, null, and undefined, as well as complex types such as objects and arrays. JavaScript frameworks are pre-written libraries or collections of reusable code that provide a structure and set of tools for developing web applications, such as Angular, React, and Vue.",
        "Virtual reality (VR) is a simulated experience that can be similar to or completely different from the real world, typically created using computer technology. Types of VR systems include desktop-based VR, mobile-based VR, and headset-based VR. Applications of VR include gaming, education and training, healthcare, architecture and design, and entertainment.",
        "A lambda function in Python is an anonymous function defined with the 'lambda' keyword. It can take any number of arguments but can only have one expression. Lambda functions are often used for short, simple operations that are passed as arguments to higher-order functions like `map`, `filter`, and `sorted`."
    ]
}