{
    "answers": [
        "JavaScript is a widely used programming language for building dynamic websites and web applications. JavaScript data types include primitive types such as numbers, strings, booleans, null, and undefined, as well as complex types such as objects and arrays. JavaScript frameworks are pre-written libraries or collections of reusable code that provide a structure and set of tools for developing web applications, such as Angular, React, and Vue.",
        "Full-stack development refers to the development of both the front-end and back-end of a web application. A full-stack developer has knowledge of both client-side (HTML, CSS, JavaScript) and server-side technologies (like Node.js, Python, Java), as well as databases (MySQL, MongoDB). Full-stack developers are capable of building and maintaining entire web applications from end to end.",
        "One-dimensional arrays are data structures that store a collection of elements in a linear sequence. They are commonly used to represent a list of items, such as numbers or strings, and can be accessed using an index. Searching and sorting algorithms, such as linear search, binary search, bubble sort, and insertion sort, can be applied to one-dimensional arrays to efficiently search and sort the elements.",
        "Virtual reality (VR) is a simulated experience that can be similar to or completely different from the real world, typically created using computer technology. Types of VR systems include desktop-based VR, mobile-based VR, and headset-based VR. Applications of VR include gaming, education and training, healthcare, architecture and design, and entertainment.",
        "A Java interface is a reference type, similar to a class, that can contain only constants, method signatures, default methods, static methods, and nested types. An interface is used to define a contract for classes to implement. The main difference between an interface and an abstract class is that an interface cannot have any method implementations, whereas an abstract class can have both abstract and concrete methods."
    ]
}